#1. Написать программу, которая будет складывать, вычитать, умножать
# или делить два числа. Числа и знак операции вводятся пользователем.
# После выполнения вычисления программа не должна завершаться,
# а должна запрашивать новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' 
# в качестве знака операции. Если пользователь вводит неверный знак
# (не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке
# и снова запрашивать знак операции. Также сообщать пользователю
# о невозможности деления на ноль, если он ввел 0 в качестве делителя.

import time

t = 1



while t != 0:
    print('Хотите немного математической магии?')
    c = str(input('Что будем  делать с числами? ( /, *, -, +, выход - 0)'))
    a = int(input('Введите первое натуральное число: '))
    b = int(input('Введите второе натуральное число: '))
    
    if c == str(0):
        t = 0
        result = ''
    elif c == '/':
        if b == 0:
            print('На ноль не делим - самолетов жалко...')
            result = ''
        else:
            result = a / b # Здесь можно было целочисленное деление поставить,
    elif c == '*':          # если так уж нужно именно натуральное число в ответе
        result = a * b
    elif c == '-':
        result = a - b
    elif c == '+':
        result = a + b
        
    else:
        print('Вы хотите странного...')
        print('Или со вводом операций ошиблись')
        result = ''
    if result != '':
        print('Вжух!!1!')
        print('И Ваши a и b превращаются...')
        time.sleep(2)
        print('Превращаются...')
        time.sleep(2)
        print('В элегантное число:', result)
        print('И это было потрясающе!!!')
    else:
        pass


print('До новых встреч!')   
    