#3. Сформировать из введенного числа обратное по порядку входящих в него цифр
# и вывести на экран. Например, если введено число 3486,
# то надо вывести число 6843.



import time


print('Расслабьтесь...')
time.sleep(1)
print('Сосредоточьтесь...')
time.sleep(1)
a = int(input('Запишите самое важное для Вас натуральное число...: '))
if a == 0:
    print('Да, ноль воистину космическое число с любой стороны')
else:
    c = a % 10
    a = a // 10
    while a != 0:
        c = c * 10 + a % 10
        a = a // 10
    print('Вжух!!1!')
    print('И Ваши самое важное число превращается...')
    time.sleep(2)
    print('Превращается...')
    time.sleep(2)
    print('В элегантное число:', c)
    print('Вот это поворот!!!')
print('До новых встреч!')