#В программе генерируется случайное целое число от 0 до 100. Пользователь
# должен его отгадать не более чем за 10 попыток. После каждой неудачной 
# попытки должно сообщаться, больше или меньше загаданного введенное
# пользователем число. Если за 10 попыток число не отгадано, то вывести его.
import random


print('Давайте сыграем  в игру?!')
print('Я загадал число от 0 до 100.')
print('У Вас есть 10 попыток его угадать.')
print('И помните, судьба мира в Ваших руках...')
a = round(random.random() * 100)
i = 10
k = 0


while i != 0:
    print('У Вас осталось', i, 'попыток')
    i -= 1
    b = int(input('Введите Ваше натуральное число: '))
    if a == b:  
        k = 1
        i = 0
    else:
        if a > b:
            print('Скромненько как-то...')
            print('Немедленно позвольте себе число больше!)')
        else:
            print('Жадничаете!')
            print('Уменьшайте число')
    
if k == 1:
     print('Поздравляю! Вы спасли мир!!!')
else:
    print()
    print('Вы израсходовали все попытки')
    print('Весь мир в труху...')
    print('А загаданное число было', a)