#Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2,
# то второй массив надо заполнить значениями 1, 4, 5, 6 
#(или 0, 3, 4, 5 – если индексация начинается с нуля), 
#так как именно в этих позициях первого массива стоят четные числа.


import random

SIZE = 10   #Блок геренарции массива честно стибрил из разобранного на уроке
array = [random.randint(0, SIZE * SIZE) for _ in range(SIZE)]
result = []

for i in range(len(array)):
    if array[i] % 2 == 0:
        result += [i]
    else:
        pass

print('Старый массив:', array)

print('Его четные элементы:', result)
