a = int(input('Введите длину первого отрезка: '))
b = int(input('Введите длину второго отрезка: '))
c = int(input('Введите длину третьего отрезка: '))

if a < b + c and b < a + c and c < a + b:
    print('Возможно у Вас есть треугольник')
    if a == b and b == c and c == a:
        print('Поздравляю!')
        print ('У Вас равносторонний треугольник')
    elif a == b or a == c or b == c:
        print('Поздравляю!')
        print('Ваш треугольник равнобедренный')
    else:
        print('Обычный, симпатичный такой треугольник')
else:
    print('Мне жаль, Вам не повезло')
    print('У Вас нет треугольника')