#Определение количества различных подстрок с использованием хеш-функции.
# Пусть дана строка S длиной N, состоящая только из маленьких латинских букв.
# Требуется найти количество различных подстрок в этой строке.

#Надеюсь,что я правильно понял задачу...


s = str(input('Введите строку: '))


def sub_str(s):
    sub = set()
    for i in range(len(s)):
        for j in range(i + 1, len(s)+1):
            sub_s = hash(s[i:j])
            if sub_s != hash(s):
                sub.add(sub_s)
    return len(sub)


print(f'строка {s} содержит {sub_str(s)} подстрок')
